Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.EntityName
The EntityName class represents the entity name filter expression.

Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions.EntityName.#ctor
Initializes a new instance of the EntityName class.